case-copy/openfoam/template/constant/freestreamProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      freestreamProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Editable per case ---------------------------------------------------------
pInf        101325;        // Pa
TInf        288.15;        // K
UInfMag     510;           // m/s   (Mach 1.5 ≈ 510, M2 ≈ 680, M2.5 ≈ 850)
UInf        (510 0 0);     // x-component must equal UInfMag
RGas        287.0;         // J/(kg·K) dry air
I           0.01;          // freestream turbulence intensity (1%), held over sweep
muRatio     234;           // eddy-viscosity ratio mu_t/mu, held over sweep

// Derived (do not edit) -----------------------------------------------------
rhoInf      #eval{ $pInf / ($RGas * $TInf) };
qInf        #eval{ 0.5 * $rhoInf * $UInfMag * $UInfMag };
// kInf, omegaInf are recomputed per case by scripts/create_case.py from
// (I, muRatio, UInfMag, TInf) so the freestream turbulence scales with Mach.
kInf        39.07;         // 1.5*(I*UInfMag)^2
omegaInf    11433;         // kInf / (muRatio * nuInf),  nuInf = muInf/rhoInf


// ************************************************************************* //
