case-copy/openfoam/template/system/surfaceFeatureExtractDict
FoamFile { version 2.0; format ascii; class dictionary; object surfaceFeatureExtractDict; }

body.stl
{
    scale               0.001;
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 150; }
    writeObj yes;
}
